ApacheBench-ab/data/ab_init_14.log
This is ApacheBench, Version 2.3 <$Revision$>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.176.22.211 (be patient).....done


Server Software:        nginx/1.8.1
Server Hostname:        10.176.22.211
Server Port:            80

Document Path:          
                       /VOD4K/Test_track17.8.mp4
                       /VOD4K/Test_track18.8.mp4
                       /VOD4K/Test_track19.8.mp4
                       /VOD4K/Test_track20.8.mp4
                       /VOD4K/Test_track29.8.mp4
                       /VOD4K/Test_track30.8.mp4
                       /VOD4K/Test_track31.8.mp4
                       /VOD4K/Test_track32.8.mp4
                       /VOD4K/Test_track41.8.mp4
                       /VOD4K/Test_track42.8.mp4
                       /VOD4K/Test_track43.8.mp4
                       /VOD4K/Test_track44.8.mp4
                       /VOD4K/Test_track53.8.mp4
                       /VOD4K/Test_track54.8.mp4
                       /VOD4K/Test_track55.8.mp4
                       /VOD4K/Test_track56.8.mp4
                       /VOD4K/Test_track73.8.mp4
                       /VOD4K/Test_track74.8.mp4
                       /VOD4K/Test_track75.8.mp4
                       /VOD4K/Test_track76.8.mp4
Document Length:        6438894 bytes

Concurrency Level:      14
Time taken for tests:   0.017 seconds, 17058.000000 us
Complete requests:      14
Failed requests:        0
Write errors:           0
Keep-Alive requests:    14
Total transferred:      6505982 bytes
HTML transferred:       6438894 bytes
Requests per second:    820.73 [#/sec] (mean)
Time per request:       17.058 [ms] (mean)
Time per request:       1.218 [ms] (mean, across all concurrent requests)
Transfer rate:          372464.42 [Kbytes/sec] received
connect:241, process:9135, wait:7136, total:9376, transfer:1999
connect:237, process:9307, wait:7796, total:9544, transfer:1511
connect:212, process:10681, wait:9049, total:10893, transfer:1632
connect:247, process:11000, wait:9082, total:11247, transfer:1918
connect:232, process:11096, wait:9379, total:11328, transfer:1717
connect:205, process:11111, wait:9672, total:11316, transfer:1439
connect:218, process:11872, wait:10253, total:12090, transfer:1619
connect:177, process:12986, wait:11406, total:13163, transfer:1580
connect:220, process:13036, wait:11674, total:13256, transfer:1362
connect:157, process:13812, wait:12519, total:13969, transfer:1293
connect:205, process:15964, wait:14278, total:16169, transfer:1686
connect:170, process:15904, wait:14540, total:16074, transfer:1364
connect:146, process:15987, wait:14308, total:16133, transfer:1679
connect:156, process:16543, wait:15171, total:16699, transfer:1372
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 11096.00 us
50 TAIL = 11096.00 us
99 TAIL = 11096.00 us
99.9 TAIL = 11096.00 us
99.99 TAIL = 11096.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 11000.00 us
50 TAIL = 11000.00 us
99 TAIL = 11000.00 us
99.9 TAIL = 11000.00 us
99.99 TAIL = 11000.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 9135.00 us
50 TAIL = 9135.00 us
99 TAIL = 9135.00 us
99.9 TAIL = 9135.00 us
99.99 TAIL = 9135.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 9307.00 us
50 TAIL = 9307.00 us
99 TAIL = 9307.00 us
99.9 TAIL = 9307.00 us
99.99 TAIL = 9307.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 12986.00 us
50 TAIL = 12986.00 us
99 TAIL = 12986.00 us
99.9 TAIL = 12986.00 us
99.99 TAIL = 12986.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 13036.00 us
50 TAIL = 13036.00 us
99 TAIL = 13036.00 us
99.9 TAIL = 13036.00 us
99.99 TAIL = 13036.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 10681.00 us
50 TAIL = 10681.00 us
99 TAIL = 10681.00 us
99.9 TAIL = 10681.00 us
99.99 TAIL = 10681.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 15964.00 us
50 TAIL = 15964.00 us
99 TAIL = 15964.00 us
99.9 TAIL = 15964.00 us
99.99 TAIL = 15964.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 11872.00 us
50 TAIL = 11872.00 us
99 TAIL = 11872.00 us
99.9 TAIL = 11872.00 us
99.99 TAIL = 11872.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 11111.00 us
50 TAIL = 11111.00 us
99 TAIL = 11111.00 us
99.9 TAIL = 11111.00 us
99.99 TAIL = 11111.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 13812.00 us
50 TAIL = 13812.00 us
99 TAIL = 13812.00 us
99.9 TAIL = 13812.00 us
99.99 TAIL = 13812.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 15904.00 us
50 TAIL = 15904.00 us
99 TAIL = 15904.00 us
99.9 TAIL = 15904.00 us
99.99 TAIL = 15904.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 16543.00 us
50 TAIL = 16543.00 us
99 TAIL = 16543.00 us
99.9 TAIL = 16543.00 us
99.99 TAIL = 16543.00 us
@MEASUREMENT(requests = 1, concurrency = 14):
AVERAGE = 15987.00 us
50 TAIL = 15987.00 us
99 TAIL = 15987.00 us
99.9 TAIL = 15987.00 us
99.99 TAIL = 15987.00 us

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      146  201   0.0    212     247
Processing:  9135 12745   2.6  12986   16543
Waiting:     7136 11161   2.7  11406   15171
Total:       9376 12946   2.5  13163   16699
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the waiting time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the total time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     16
  80%     16
  90%     16
  95%     17
  98%     17
  99%     17
 100%     17 (longest request)